In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/rev.csv')
df.head(3)

   Year Revenue  Salary   Revenue_1  Status
0  2000   $1000  2000.0  $1,000.00        0
1  2001   $2000  3000.0  $2,000.00        0
2  2002   $3000  4000.0  $3,000.00        0

In [3]:
df['Revenue'] = df['Revenue'].str.strip('$')
df['Revenue'] = df['Revenue'].astype('int')
df.head(3)

   Year  Revenue  Salary   Revenue_1  Status
0  2000     1000  2000.0  $1,000.00        0
1  2001     2000  3000.0  $2,000.00        0
2  2002     3000  4000.0  $3,000.00        0

In [5]:
df.drop(df[df['Revenue'] < 4000].index, inplace = True)

In [7]:
df.head(3)

   Year  Revenue  Salary   Revenue_1  Status
3  2003     4000  5000.0  $4,000.00        0
4  2004     5000  6000.0  $5,000.00        0
5  2005     6000  7000.0  $6,000.00        0